
invalid_field_value_class=\u30d5\u30a3\u30fc\u30eb\u30c9\u306e\u5024\u306b\u306f\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u578b {0} \u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u307e\u305b\u3093
invalid_field_definition={0} \u304c\u898b\u3064\u304b\u308a\u307e\u3057\u305f\u304c\u3001\u671f\u5f85\u3055\u308c\u308b\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u578b\u306fFieldDefinition\u3067\u3059
field_defs_iter_does_not_support_remove=\u30a4\u30c6\u30ec\u30fc\u30bf\u306eremove\u30e1\u30bd\u30c3\u30c9\u3092\u4f7f\u7528\u3057\u3066\u30d5\u30a3\u30fc\u30eb\u30c9\u5b9a\u7fa9\u3092\u524a\u9664\u3067\u304d\u307e\u305b\u3093
null_field_name=\u30d5\u30a3\u30fc\u30eb\u30c9\u540d\u304c\u5fc5\u8981\u3067\u3059
no_fields=\u30d5\u30a3\u30fc\u30eb\u30c9\u304c\u5b9a\u7fa9\u3055\u308c\u3066\u3044\u307e\u305b\u3093
no_key_fields=\u30ad\u30fc \u30d5\u30a3\u30fc\u30eb\u30c9\u304c\u5b9a\u7fa9\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002\u5c11\u306a\u304f\u3068\u3082\uff11\u3064\u306e\u30ad\u30fc \u30d5\u30a3\u30fc\u30eb\u30c9\u3092\u6307\u5b9a\u3057\u3066\u304f\u3060\u3055\u3044
no_data_fields=\u30c7\u30fc\u30bf \u30d5\u30a3\u30fc\u30eb\u30c9\u304c\u5b9a\u7fa9\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002\u5c11\u306a\u304f\u3068\u3082\uff11\u3064\u306e\u30c7\u30fc\u30bf \u30d5\u30a3\u30fc\u30eb\u30c9\u3092\u6307\u5b9a\u3057\u3066\u304f\u3060\u3055\u3044
insufficient_fields=\u4e0d\u5341\u5206\u306a\u30d5\u30a3\u30fc\u30eb\u30c9\u6570\u304c\u5b9a\u7fa9\u3055\u308c\u307e\u3057\u305f
invalid_configuration=\u30b5\u30fc\u30d3\u30b9\u8a2d\u5b9a\u304c\u4e0d\u6b63\u3067\u3059
serialization_failed=\u30b5\u30fc\u30d3\u30b9\u8a2d\u5b9a\u306e\u76f4\u5217\u5316\u304c\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002\u7406\u7531\uff1a {0}
deserialization_failed=\u30b5\u30fc\u30d3\u30b9\u8a2d\u5b9a\u306e\u975e\u76f4\u5217\u5316\u304c\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002\u7406\u7531\uff1a{0}
invalid_threshold_size=\u95be\u5024\u306b\u306f-1\u304b0\u4ee5\u4e0a\u3092\u6307\u5b9a\u3057\u3066\u304f\u3060\u3055\u3044\u3002\u73fe\u5728\u306e\u5024 {0}
invalid_entry_removal_criteria=\u30a8\u30f3\u30c8\u30ea\u306e\u524a\u9664\u6761\u4ef6\u304c\u4e0d\u6b63\u3067\u3059\u3002\u691c\u51fa {0}
invalid_capacity_value=\u521d\u671f\u8a31\u5bb9\u5024\u306b\u306f0\u4ee5\u4e0a\u3067\u95be\u5024\u4ee5\u4e0b\u3092\u6307\u5b9a\u3057\u3066\u304f\u3060\u3055\u3044\u3002\u691c\u51fa {0}
field_definitions_name=\u30d5\u30a3\u30fc\u30eb\u30c9\u5b9a\u7fa9\u30c6\u30fc\u30d6\u30eb
field_definitions_desc=\u305d\u308c\u305e\u308c\u306e\u30ad\u30e3\u30c3\u30b7\u30e5 \u30a8\u30f3\u30c8\u30ea\u30fc\u306e\u4e00\u90e8\u5206\u3068\u306a\u308b\u7570\u306a\u308b\u30ad\u30fc\u3068\u30c7\u30fc\u30bf \u30d5\u30a3\u30fc\u30eb\u30c9
threshold_size_name=\u30ad\u30e3\u30c3\u30b7\u30e5\u306e\u95be\u5024
threshold_size_desc=\u53e4\u3044\u30a8\u30f3\u30c8\u30ea\u30fc\u304c\u5931\u308f\u308c\u308b\u524d\u306e\u30ad\u30e3\u30c3\u30b7\u30e5\u306e\u95be\u5024\u306e\u9650\u754c
entry_removal_criteria_name=\u30a8\u30f3\u30c8\u30ea\u30fc\u524a\u9664\u306e\u57fa\u6e96
entry_removal_criteria_desc=\u95be\u5024\u3092\u5b9a\u7fa9\u3057\u305f\u5834\u5408\u3001\u3053\u306e\u30d7\u30ed\u30d1\u30c6\u30a3\u3067\u95be\u5024\u306b\u9054\u3057\u305f\u969b\u306b\u3069\u306e\u30a8\u30f3\u30c8\u30ea\u3092\u524a\u9664\u3059\u308b\u304b\u6307\u5b9a\u3057\u307e\u3059\u3002Least recenty added - \u6700\u521d\u306b\u8ffd\u52a0\u3055\u308c\u305f\u30a8\u30f3\u30c8\u30ea\u30fc\u304c\u524a\u9664\u3055\u308c\u307e\u3059 Least rencetly updated - \u6700\u521d\u306b\u8ffd\u52a0\u3055\u308c\u66f4\u65b0\u3055\u308c\u3066\u3044\u306a\u3044\u30a8\u30f3\u30c8\u30ea\u30fc\u304b\u3001\u3082\u3057\u5168\u3066\u306e\u30a8\u30f3\u30c8\u30ea\u30fc\u304c\u66f4\u65b0\u3055\u308c\u3066\u3044\u308b\u5834\u5408\u306f\u3082\u3063\u3068\u3082\u521d\u671f\u306b\u66f4\u65b0\u3055\u308c\u305f\u30a8\u30f3\u30c8\u30ea\u30fc\u304c\u524a\u9664\u3055\u308c\u307e\u3059 Lest recently accessed - \u6700\u521d\u306b\u8ffd\u52a0\u3001\u66f4\u65b0\u307e\u305f\u306f\u53c2\u7167\u3055\u308c\u305f\u30a8\u30f3\u30c8\u30ea\u30fc\u304c\u524a\u9664\u3055\u308c\u307e\u3059
initial_capacity_name=\u521d\u671f\u30ad\u30e3\u30c3\u30b7\u30e5 \u30b5\u30a4\u30ba
initial_capacity_desc=\u521d\u671f\u5316\u3055\u308c\u308b\u30ad\u30e3\u30c3\u30b7\u30e5 \u30b9\u30c8\u30ec\u30fc\u30b8\u306e\u5927\u307e\u304b\u306a\u521d\u671f\u5024\u3002\u5b9f\u88c5\u72b6\u6cc1\u306b\u4f9d\u5b58\u3057\u3066\u30ea\u30b5\u30a4\u30ba\u3055\u308c\u307e\u3059\u306e\u3067\u3001\u30ea\u30b5\u30a4\u30ba\u4f5c\u696d\u3092\u6700\u5c0f\u5316\u3059\u308b\u9069\u5207\u306a\u5024\u3092\u6307\u5b9a\u3057\u3066\u304f\u3060\u3055\u3044