xsl_name=XSL
xsl_desc=XSL \u306f XML \u30d9\u30fc\u30b9\u306e\u30b9\u30bf\u30a4\u30eb \u30b7\u30fc\u30c8\u3067\u30c7\u30fc\u30bf\u5909\u63db\u306b\u4f7f\u7528\u3057\u307e\u3059\u3002
jms_message_xsl_name=JMS \u30e1\u30c3\u30bb\u30fc\u30b8 XSL
jms_message_xsl_desc=\u30a2\u30a6\u30c8\u30d7\u30c3\u30c8 \u30e1\u30c3\u30bb\u30fc\u30b8\u306e\u30e1\u30c3\u30bb\u30fc\u30b8 \u30d7\u30ed\u30d1\u30c6\u30a3\u306e\u8a2d\u5b9a\u306b\u4f7f\u7528\u3055\u308c\u308b xslt
tf_class_name_name=\u30c8\u30e9\u30f3\u30b9\u30d5\u30a9\u30fc\u30de \u30d5\u30a1\u30af\u30c8\u30ea \u30af\u30e9\u30b9
tf_class_name_desc=\u5909\u63db\u3092\u5b9f\u884c\u3059\u308b\u305f\u3081\u306b Saxon \u307e\u305f\u306f Xalan \u4ee5\u5916\u306e\u30c8\u30e9\u30f3\u30b9\u30d5\u30a9\u30fc\u30de\u5b9f\u88c5\u3092\u4f7f\u7528\u3059\u308b\u5834\u5408\u306e\u30c8\u30e9\u30f3\u30b9\u30d5\u30a9\u30fc\u30de \u30af\u30e9\u30b9\u306e\u540d\u524d\u3002\u6ce8\u610f: \u6307\u5b9a\u3059\u308b\u30af\u30e9\u30b9\u306f\u3001"Javax.xml.transform.TransformerFactory" \u306e\u5b9f\u88c5\u3067\u3042\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
user_xsl_name=XSL
user_xsl_desc=\u5909\u63db\u306e\u305f\u3081\u306e\u30e6\u30fc\u30b6\u30fc\u5b9a\u7fa9\u306e XSL
user_jms_message_xsl_name=JMS \u30e1\u30c3\u30bb\u30fc\u30b8 XSL
user_jms_message_xsl_desc=\u30a2\u30a6\u30c8\u30d7\u30c3\u30c8 \u30e1\u30c3\u30bb\u30fc\u30b8\u306e JMS \u30e1\u30c3\u30bb\u30fc\u30b8 \u30d7\u30ed\u30d1\u30c6\u30a3\u306e\u30bb\u30c3\u30c8\u306b\u4f7f\u7528\u3055\u308c\u308b xslt
project_name=\u30de\u30c3\u30d4\u30f3\u30b0
project_desc=Fiorano Maapper \u3092\u4f7f\u7528\u3057\u3066\u751f\u6210\u53ef\u80fd\u306a Fiorano Mapper \u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3092\u5b9a\u7fa9\u3057\u307e\u3059\u3002\u5b9a\u7fa9\u306b\u306f\u3001\u30a4\u30f3\u30d7\u30c3\u30c8\u69cb\u9020\u3001\u30a2\u30a6\u30c8\u30d7\u30c3\u30c8\u69cb\u9020\u3001\u30de\u30c3\u30d4\u30f3\u30b0\u5b9a\u7fa9\u304c\u542b\u307e\u308c\u307e\u3059\u3002\u5909\u63db\u306b\u5fc5\u8981\u306a XSL \u306f\u3001 Fiorano Mapper \u306b\u5b9a\u7fa9\u3055\u308c\u305f\u30de\u30c3\u30d4\u30f3\u30b0\u306b\u57fa\u3065\u3044\u3066\u81ea\u52d5\u7684\u306b\u751f\u6210\u3055\u308c\u307e\u3059\u3002
mapper_used_name=\u5909\u63db\u306b\u30de\u30c3\u30d1\u30fc\u3092\u4f7f\u7528
mapper_used_desc=XSL \u306e\u5b9a\u7fa9\u306b\u30de\u30c3\u30d1\u30fc\u3092\u4f7f\u7528\u3059\u308b\u5834\u5408\u306f\u3001"\u306f\u3044" \u3092\u9078\u629e\u3057\u3066\u304f\u3060\u3055\u3044\u3002\u30de\u30cb\u30e5\u30a2\u30eb\u3067 XSL \u3092\u6307\u5b9a\u3059\u308b\u5834\u5408\u306f\u3001"\u3044\u3044\u3048" \u3092\u9078\u629e\u3057\u307e\u3059\u3002
input_structures_name=\u5909\u63db\u30bd\u30fc\u30b9 \u30c7\u30fc\u30bf
input_structures_desc=\u30a4\u30f3\u30d7\u30c3\u30c8 \u30e1\u30c3\u30bb\u30fc\u30b8\u306e\u30dc\u30c7\u30a3\u3092\u5909\u63db\u3059\u308b\u5834\u5408\u306f\u3001"\u30dc\u30c7\u30a3" \u3092\u9078\u629e\u3057\u307e\u3059\u3002\u30a4\u30f3\u30d7\u30c3\u30c8 \u30e1\u30c3\u30bb\u30fc\u30b8\u306e\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u3092\u5909\u63db\u3059\u308b\u5834\u5408\u306f\u3001"\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8" \u3092\u9078\u629e\u3057\u307e\u3059\u3002\u30a4\u30f3\u30d7\u30c3\u30c8 \u30e1\u30c3\u30bb\u30fc\u30b8\u306e\u30dc\u30c7\u30a3\u3068\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3 \u30b3\u30f3\u30c6\u30ad\u30c3\u30b9\u306e\u4e21\u65b9\u3092\u5909\u63db\u3059\u308b\u5834\u5408\uff53\uff53\u306b\u306f\u3001"\u30dc\u30c7\u30a3 - \u30b3\u30f3\u30c6\u30ad\u30b9\u30c8" \u3092\u9078\u629e\u3057\u307e\u3059\u3002\u3053\u306e\u5834\u5408\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3 \u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u306e XML \u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u304c\u30d7\u30e9\u30a4\u30de\u30ea\u306e\u30bd\u30fc\u30b9\u3068\u3057\u3066\u3042\u3042\u4f7f\u308f\u308c\u307e\u3059\u3002\u6ce8\u610f: \u30d7\u30e9\u30a4\u30de\u30ea \u30bd\u30fc\u30b9\u306e\u30a8\u30ec\u30e1\u30f3\u30c8\u306f XSL \u5185\u3067\u76f4\u63a5\u53c2\u7167\u3067\u304d\u307e\u3059\u3002\u4ed6\u306e\u69cb\u9020\u306e\u30a8\u30ec\u30e1\u30f3\u30c8\u306f\u3001\u30c9\u30ad\u30e5\u30e1\u30f3\u30c8\u3068\u3057\u3066\u53c2\u7167\u3055\u308c\u307e\u3059 (\u69cb\u9020\u540d)/\u30a8\u30ec\u30e1\u30f3\u30c8\u540d)\u3002
output_structure_name=\u5909\u63db\u30ea\u30b6\u30eb\u30c8\u306e\u30bb\u30c3\u30c8
output_structure_desc=\u5909\u63db\u30ea\u30b6\u30eb\u30c8\u3092\u30a2\u30a6\u30c8\u30d7\u30c3\u30c8 \u30e1\u30c3\u30bb\u30fc\u30b8\u306e\u30dc\u30c7\u30a3\u306b\u30bb\u30c3\u30c8\u3059\u308b\u5834\u5408\u306f\u3001"\u30dc\u30c7\u30a3" \u3092\u9078\u629e\u3057\u307e\u3059\u3002\u5909\u63db\u30ea\u30b6\u30eb\u30c8\u3092\u30a2\u30a6\u30c8\u30d7\u30c3\u30c8 \u30e1\u30c3\u30bb\u30fc\u30b8\u306e\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3 \u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u306b\u30bb\u30c3\u30c8\u3059\u308b\u5834\u5408\u306f\u3001\u7d3a\u30c6\u30a4\u30b9\u30c8" \u3092\u9078\u629e\u3057\u307e\u3059\u3002
strip_white_spaces_name=\u7a7a\u767d\u306e\u524a\u9664
strip_white_spaces_desc= None - \u7a7a\u767d\u306e\u51e6\u7406\u30a2\u30c8\u30ea\u30d3\u30e5\u30fc\u30c8\u3068\u3057\u3066\u306f\u4f55\u3082\u8a2d\u5b9a\u3055\u308c\u307e\u305b\u3093\u3002\u7a7a\u767d\u306f\u30c8\u30e9\u30f3\u30b9\u30d5\u30a9\u30fc\u30de\u306b\u5b9f\u88c5\u306b\u5f93\u3044\u307e\u3059\u3002True - \u5909\u63db\u306e\u5b8c\u4e86\u306e\u524d\u306b XML \u304b\u3089\u7a7a\u767d\u304c\u524a\u9664\u3055\u308c\u307e\u3059\u3002False - \u7a7a\u767d\u306f\u5143\u306e\u307e\u307e\u4fdd\u6301\u3055\u308c\u307e\u3059\u3002
fail_on_errors_name=\u30a8\u30e9\u30fc\u767a\u751f\u6642\u306e\u5909\u63db\u51e6\u7406
fail_on_errors_desc=\u3053\u306e\u30d7\u30ed\u30d1\u30c6\u30a3\u306f\u3001\u5909\u63db\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u305f\u5834\u5408\u306e\u52d5\u4f5c\u3092\u5b9a\u7fa9\u3057\u307e\u3059\u3002"\u306f\u3044" \u306e\u5834\u5408\u3001\u30c8\u30e9\u30f3\u30b9\u30d5\u30a9\u30fc\u30de\u306e\u30a8\u30e9\u30fc\u306f\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u306e\u30a8\u30e9\u30fc\u3068\u3057\u3066\u30ec\u30dd\u30fc\u30c8\u3055\u308c\u307e\u3059\u3002\u30ef\u30fc\u30cb\u30f3\u30b0\u306f\u3001\u30ed\u30b0\u30ec\u30d9\u30eb\u304c\u8b66\u544a\u306b\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u308c\u3070\u30ed\u30b0\u3055\u308c\u3001\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u306e\u30a8\u30e9\u30fc\u3068\u3057\u3066\u6271\u308f\u308c\u307e\u3059\u3002"\u3044\u3044\u3048" \u306e\u5834\u5408\u3001\u30ed\u30b0\u30ec\u30d9\u30eb\u304c\u8b66\u544a\u3067\u3042\u308c\u3070\u30a8\u30e9\u30fc\u3082\u30ef\u30fc\u30cb\u30f3\u30b0\u3082\u30ed\u30b0\u3055\u308c\u307e\u3059\u3002\u5909\u63db\u7d50\u679c\u306f\u51fa\u529b\u3055\u308c\u307e\u3059\u3002\u6ce8\u610f: \u30c8\u30e9\u30f3\u30b9\u30d5\u30a9\u30fc\u30de\u306e\u30d5\u30a7\u30fc\u30bf\u30eb \u30a8\u30e9\u30fc\u306f\u5e38\u306b\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u306e\u30a8\u30e9\u30fc\u3068\u3057\u3066\u30ec\u30dd\u30fc\u30c8\u3055\u308c\u307e\u3059\u3002
do_optimization_name=\u6700\u9069\u5316
do_optimization_desc= \u3053\u306e\u30d7\u30ed\u30d1\u30c6\u30a3\u306f\u30e9\u30fc\u30b8 \u30b5\u30a4\u30ba \u30c7\u30fc\u30bf\u306e\u5909\u63db\u306b\u9069\u7528\u3055\u308c\u307e\u3059\u3002"\u306f\u3044" \u306e\u5834\u5408\u3001\u30e1\u30e2\u30ea\u4f7f\u7528\u3092\u6700\u9069\u5316\u3059\u308b\u76ee\u7684\u3067\u3001\u5909\u63db\u306e\u958b\u59cb\u524d\u306b\u30a4\u30f3\u30bf\u30fc\u30ca\u30eb\u69cb\u9020\u306f\u30a4\u30f3\u30d7\u30c3\u30c8 \u30e1\u30c3\u30bb\u30fc\u30b8\u304b\u3089\u524a\u9664\u3055\u308c\u307e\u3059\u3002\u3053\u306e\u30d7\u30ed\u30d1\u30c6\u30a3\u304c "\u306f\u3044" \u306b "\u5909\u63db\u30ea\u30b6\u30eb\u30c8\u306e\u30bb\u30c3\u30c8" \u30d7\u30ed\u30d1\u30c6\u30a3\u304c "\u30dc\u30c7\u30a3" \u306b\u8a2d\u5b9a\u3055\u308c\u305f\u5834\u5408\u3001Fiorano Mapper \u306e "JMS \u30e1\u30c3\u30bb\u30fc\u30b8 \u30d5\u30a1\u30f3\u30af\u30b7\u30e7\u30f3" \u30d5\u30a1\u30f3\u30af\u30ec\u30c3\u30c8\u306e "\u30c6\u30ad\u30b9\u30c8-\u30b3\u30f3\u30c6\u30f3\u30c4" \u3068 "\u30d0\u30a4\u30c8-\u30b3\u30f3\u30c6\u30f3\u30c4" \u306f\u4f7f\u7528\u3067\u304d\u307e\u305b\u3093\u3002\u6ce8\u610f: \u3053\u306e\u30d7\u30ed\u30d1\u30c6\u30a3\u306f\u3001"JMS \u30e1\u30c3\u30bb\u30fc\u30b8 XSL" \u304c\u5b9a\u7fa9\u3055\u308c\u3066\u3044\u306a\u3044\u5834\u5408\u306b\u306e\u307f\u6709\u52b9\u3067\u3059\u3002
xslt_engine_name=Xslt \u30a8\u30f3\u30b8\u30f3
xslt_engine_desc=\u5909\u63db\u306b\u4f7f\u7528\u3055\u308c\u308b\u30c8\u30e9\u30f3\u30b9\u30d5\u30a9\u30fc\u30de\u306e\u5b9f\u88c5\u3002\u30e6\u30fc\u30b6\u30fc\u72ec\u81ea\u306e\u30ab\u30b9\u30bf\u30e0 \u30c8\u30e9\u30f3\u30b9\u30d5\u30a9\u30fc\u30de\u3092\u4f7f\u7528\u3059\u308b\u5834\u5408\u306f\u3001"\u305d\u306e\u4ed6" \u3092\u9078\u629e\u3057\u307e\u3059\u3002
structure_name=\u30a4\u30f3\u30d7\u30c3\u30c8\u306e\u69cb\u9020\u540d
structure_name_desc=\u3053\u306e\u30d7\u30ed\u30d1\u30c6\u30a3\u306f\u3001\u6307\u5b9a\u3055\u308c\u305f XSL \u3067\u53c2\u7167\u3055\u308c\u308b\u69cb\u9020\u306e\u540d\u524d\u3092\u5b9a\u7fa9\u3057\u307e\u3059\u3002
xsl_not_provided=\u5909\u63db\u30af\u30e9\u30b9\u304c\u6307\u5b9a\u3055\u308c\u3066\u3044\u307e\u305b\u3093